// Написать set [добавление, удаление, поиск по значению (isExist())]
#include <stdio.h>

int main()
{

    int tmp[10];
    tmp[0] = 'a';
    printf(tmp);
}
